tutorials/incompressible/simpleFoam/windAroundBuildings/system/streamLines
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

streamLines
{
    type  streamLine;

    libs  ("libfieldFunctionObjects.so");

    // Time control etc
    ${_visualization};

    setFormat       vtk;

    // Velocity field to use for tracking.
    U               U;

    // Tracked forwards (+U) or backwards (-U)
    trackForward    true;

    // Names of fields to sample. Should contain above velocity field!
    fields          (p U);

    // Steps particles can travel before being removed
    lifeTime        10000;

    // Number of steps per cell (estimate). Set to 1 to disable subcycling.
    nSubCycle       5;

    // Cloud name to use
    cloud           particleTracks;

    // Seeding method.
    seedSampleSet
    {
        type        uniform;
        axis        x;  //distance;

        // Note: tracks slightly offset so as not to be on a face
        start       (0 -20 15);
        end         (0 150 15);
        nPoints     40;
    }
}


// ************************************************************************* //
